#+TITLE: Modernes C++\linebreak \small...für Programmierer \hfill Unit 10: Idioms und Patterns
#+AUTHOR: Dr. Günter Kolousek
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX: \newcommand{\cppXI}{C++11\xspace}
#+LATEX: \newcommand{\cppXIV}{C++14\xspace}
#+LATEX: \newcommand{\cppXVII}{C++17\xspace}

* CRTP -- 2
\vspace{1.7em}
\footnotesize
#+header: :exports both :results output :tangle src/crtp.cpp :flags -std=c++17
#+begin_src C++
#include <iostream>
using namespace std;  // crpt.cpp

template<typename Child>
struct Base {
    void interface() {
        static_cast<Child*>(this)->implementation();
    }
};
struct Derived : Base<Derived> {
    void implementation() {
        cout << "derived implementation" << endl;
    }
};

int main() {
    Derived d;
    d.interface();
}
#+end_src

#+RESULTS:
: derived implementation

